#!/usr/bin/env python
# encoding: utf-8
"""
@project: 
@author: kuangcx
@contact: 18279911430@163.com
@file: __init__.py.py
@time: 2022/9/14 17:37
@ide: PyCharm
@desc: 
"""
import random

"""
3: 无重复字符的最长子串
5: 最长回文子串
6: z字形变换
19: 删除链表的倒数第n个节点
21: 合并两个有序链表
22: 括号生成
50: 手动实现幂函数
54: 螺旋矩阵
70: 爬楼梯
83: 删除排序链表中的重复数字
94: 二叉树的中序遍历
100: 相同的树
101: 对称二叉树
103: 二叉树的锯齿形层序遍历
108: 将有序数组转换为二叉搜索树
110: 平衡二叉树
114: 二叉树展开为链表
118: 杨辉三角
119: 杨辉三角II
128: 最长连续序列
133: 克隆图
134: 加油站
136: 只出现一次的数字
145: 二叉树的后序遍历
150: 逆波兰表达式求值
168: Excel表列名称
181: 超过经理收入的员工
205: 同构字符串
206: 反转列表
217: 存在重复元素
228: 汇总区间
343: 整数拆分
401: 二进制手表
442: 数组中重复的数据
476: 数字的补数
493: 翻转对                    未完成
496: 下一个更大元素
509: 菲波那切数
590: N叉树的后续遍历
565: 数组嵌套
572: 另一棵树的子树
595: 分糖果
605: 种花问题
607: 销售员(SQL)
611: 有效三角形
623: 在二叉树中增加一行
670: 最大交换
696: 计数二进制子串
731: 我的日程安排表II
746: 最小花费爬楼梯
749: 隔离病毒 (困难)
769: 最多能完成排序的块
804: 唯一摩尔斯密码词
811: 子域名访问计数
814: 二叉树剪枝
844: 比较含退格的字符串
859: 亲密字符串
876: 链表的中间结点
883: 三维形体投影面积
892: 三维形体的表面积
897: 递增顺序搜索树
919: 完全二叉树插入器
925: 长按键入
933: 最近的请求次数
946: 验证栈序列
965: 单值二叉树
993: 二叉树的堂兄弟节点
1018: 可被5整除的二进制前缀
1030: 距离顺序排列矩阵单元格
1048: 最长字符串链
1084: 销售分析III
1093: 大样本统计
1105: 填充书架
1232: 判断点是否都在同一直线上
1260: 二维网格的迁移
1262: 可被三整除的最大和
1267: 统计参与通信的服务器
1295: 统计位数为偶数的数字
1334: 阈值距离内邻居最少的城市
1337: 矩阵中战斗力最弱的k行
1403: 非递增顺序的最小子序列
1437: 是否所有1都至少相隔k各元素
1450: 在既定时间内做作业的学生数
1475: 商品折扣的最终价格
1480: 一维数组的动态和
1502: 爱生气的书店老板[滑动窗口]
1588: 所有奇数长度子数组的和
1598: 文件夹日志操作搜集器
1663: 具有给定数值的最小字符串
1672: 最富有客户的资产总量
1679: K 和数对的最大数目
1689: 十-二进制数的最少数目
1693: 每天的领导和合伙人
1704: 判断字符串的两半是否相似
1723: 完成所有工作的最短时间 (困难)
1741: 查找每个员工花费的总时间
1753: 移除石子的最大得分
1827: 最少操作使数组递增
1832: 判断句子是否为全字母句
1895: 最大的幻方
1952: 三除数
1967: 作为子字符串出现在单词中的字符串数目
2022: 将一维数组转变为二维数组
2032: 至少在两个数组中出现的值
2033: 获取单值网络的最小操作数
2047: 句子中的有效单词数
2050: 并行课程 III
2053: 第k个独一无二的字符串
2114: 句子中最多的单词数
2119: 反转两次的数字
2236: 判断根节点是否等于子节点之和
2239: 找到最接近0的数字
2248: 多个数组求交集
2325: 解密消息
2347: 最好的扑克手牌
2373: 矩阵中的局部最大值
2423: 删除字符使频率相同
2502: 设计内存分配器
"""
